<!DOCTYPE html>
<html lang="pt-br">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Aula 11</title>
    <link rel="stylesheet" href="./css/style.css">

</head>
<body>
    
    <h1><a href="https://flexboxfroggy.com/#pt-br" style="font-size: 13px;"><strong>FLEXBOX FROGGY</strong></a></h1>

    <p>&nbsp;</p>
    
    <h1><strong>justify-content</strong></h1>
    
    <p>&nbsp;</p>
    
    <p>Use justify-content de novo para levar os sapos &agrave;s suas vit&oacute;rias-r&eacute;gias. Lembre-se que essa propriedade CSS alinha os itens horizontalmente e aceita os seguintes valores:<br />
    &nbsp; &nbsp;&nbsp;</p>
    
    <ol>
        <li>flex-start: Itens se alinham &agrave; esquerda do container.</li>
        <li>flex-end: Itens se alinham &agrave; direita do container.</li>
        <li>center: Itens se alinham no centro do container.</li>
        <li>space-between: Itens se alinham com dist&acirc;ncia igual entre eles.</li>
        <li>space-around: Itens se alinham com dist&acirc;ncia igual em torno deles</li>
    </ol>
    
    <h1><br />
    <strong>align-items</strong></h1>
    
    <ol>
        <li>flex-start: Itens se alinham na parte de cima do container.</li>
        <li>flex-end: Itens se alinham na parte de baixo do container.</li>
        <li>center: Itens se alinham no centro vertical do container.</li>
        <li>baseline: Items se alinham na linha da base do container.</li>
        <li>stretch: Itens se esticam para preencher o container.</li>
    </ol>
    
    <h1><br />
    <strong>flex-direction</strong></h1>
    
    <p>Os sapos precisam ficar na mesma ordem das vit&oacute;rias-r&eacute;gias usando flex-direction. Esta propriedade CSS define a dire&ccedil;&atilde;o em que os itens s&atilde;o posicionados no container e aceita os seguintes valores:</p>
    
    <ol>
        <li>row: Itens s&atilde;o posicionados na mesma dire&ccedil;&atilde;o do texto.</li>
        <li>row-reverse: Itens s&atilde;o posicionados na dire&ccedil;&atilde;o oposta &agrave; do texto.</li>
        <li>column: Itens s&atilde;o posicionados de cima para baixo.</li>
        <li>column-reverse: Itens s&atilde;o posicionados de baixo para cima.</li>
    </ol>
    
    <h1><strong>&nbsp;</strong></h1>
    
    <h1><strong>order&nbsp;</strong></h1>
    
    <p><br />
    &Agrave;s vezes, reverter a ordem de uma coluna ou de um <em>container </em>n&atilde;o &eacute; suficiente. Nesses casos, podemos aplicar a propriedade <strong>order </strong>para itens individuais. Por padr&atilde;o, itens tem um valor de <strong>0,</strong> mas n&oacute;s podemos usar essa propriedade para alterar para um valor inteiro positivo ou negativo.</p>
    
    <p>Use a propriedade order para reordenar os sapos de acordo com suas vit&oacute;rias-r&eacute;gias.</p>
    
    <h1><br />
    <strong>align-self</strong></h1>
    
    <p><br />
    Outra propriedade que voc&ecirc; pode aplicar para itens individuais &eacute; align-self. Esta propriedade aceita os mesmos valores que align-items e seus valores s&atilde;o usados para o item espec&iacute;fico.</p>
    
    <p><br />
    <strong>flex-wrap,</strong></p>
    
    <p>que aceita os seguintes valores:</p>
    
    <ol>
        <li>nowrap: Todos os itens s&atilde;o apertados em uma &uacute;nica linha.</li>
        <li>wrap: Itens se separam em linhas adicionais.</li>
        <li>wrap-reverse: Itens se separam em linhas adicionais em reverso.</li>
    </ol>
    
    <h1><br />
    As duas propriedades flex-direction e flex-wrap s&atilde;o usadas t&atilde;o frequentemente juntas que uma propriedade abreviada <strong>flex-flow</strong></h1>
    
    <p><strong>align-content</strong> para definir como m&uacute;ltiplas linhas devem ser espa&ccedil;adas uma das outras. Essa propriedade recebe os seguintes valores:</p>
    
    <ol>
        <li>flex-start: Linhas s&atilde;o agrupadas no topo do container.</li>
        <li>flex-end: Linhas s&atilde;o agrupadas no fundo do container.</li>
        <li>center:Linhas s&atilde;o agrupadas no centro vertical do container.</li>
        <li>space-between: Linhas s&atilde;o posicionadas com espa&ccedil;o igual entre elas.</li>
        <li>space-around: Linhas s&atilde;o posicionadas com espa&ccedil;o igual em torno delas.</li>
        <li>stretch: Linhas se esticam para preencher o container.</li>
        <li>Isso pode ser confuso, mas align-content determina o espa&ccedil;amento entre linhas, enquanto align-items determina como as linhas como um todo s&atilde;o alinhadas dentro do container. Quando h&aacute; s&oacute; uma linha, align-content n&atilde;o tem nenhum efeito.</li>
    </ol>
    
        <a href="https://flexboxfroggy.com/#pt-br" title="Froggy"></a>

</body>
</html>